app/controllers/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT * FROM "categories"

  def edit
    @category = Category.find(params[:id])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 17)

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("catname", "created_at", "updated_at", "catid") VALUES('Accessories', '2010-06-06 19:42:16', '2010-06-06 19:42:16', 1)

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 17)
UPDATE "categories" SET "updated_at" = '2010-06-06 20:04:18', "catid" = 17 WHERE "id" = 17

  def plutozhome
    categories = Category.all
---
SELECT * FROM "categories"